# parameters
nc: 1  # number of classes
nkpt: 7 # number of keypoints

depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
act: "ReLU"    #All activation must be taken from here
# anchor
dw_conv_kpt: True
anchors:
  - [ 5,6, 8,14, 15,11 ] # P3/8
  - [ 19,27,  44,40,  38,94 ]  # P4/16
  - [ 96,68,  86,152,  180,137 ]  # P5 / 32

backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
    [-1, 3, C2f, [128, True]],
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
    [-1, 6, C2f, [256, True]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 6, C2f, [512, True]],
    [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
    [-1, 3, C2f, [1024, True]],
    [-1, 1, SPPF, [1024, 5]],  # 9
  ]
head:
  [
    [ [ 2, 4, 6, 9 ], 1, ChannelSelection_Top, [384] ], #10
    [ -1, 1, FusionEncoder, [ [ 32, 32 ],32 ] ], # 11
    [ [ 4, -1 ], 1, WeightedInject, [ 128 , 64 ] ],# 12
    [ -1, 3, C2f, [ 256 ] ],#13 top
    [ [ 2, 4, 6, 9 ], 1, ChannelSelection_Medium, [ 768 ] ], #14
    [ -1, 1, FusionEncoder, [ [ 64 , 64 ] , 64 ] ], # 15
    [ [ 6, -1 ], 1, WeightedInject, [ 256,128 ] ],# 16
    [ -1, 3, C2f, [ 512 ] ],#17 medium
    [ [ 2, 4, 6, 9 ], 1, ChannelSelection_Bottom, [ 1534 ] ], #18
    [ -1, 1, FusionEncoder, [ [ 128 , 128 ], 128 ] ], # 19
    [ [ 9 , -1 ], 1, WeightedInject, [ 512 , 256 ] ],# 20
    [ -1, 3, C2f, [ 1024 ] ],#21 bottom
    [[13, 17, 21], 1, Detect, [ nc, anchors, nkpt ] ],
  ]